Catalogs/НеСозданныеЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НеСозданныеЗаказыПокупателей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Addres</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddresFakt</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddresFaktID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DogovorID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dostavka</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMailЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilialID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirmID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>INN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KontragentID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KPP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderSource</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SkladID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TipDost</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValutaID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателяСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтправленВМДМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНайденаНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленнаяОтгрузкаГМИзСтороннегоФилиала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенЗаказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторныхЗапросовВМДМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПрайсЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЗаказаПортал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>22</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NumberInv</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Brand</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Articul</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDIzmer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price_Zak</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноКОтгрузке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОтгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНайденаНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинхронизированСМДМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводительПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверенаСкидкаНаБренд</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДоговорыАварды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыАварды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАварда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СинонимыПроизводителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СинонимыПроизводителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СинонимПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НеСозданныеЗаказыПокупателей/Ext/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = "";
	Addres = "";
	AddresFakt = "";
	AddresFaktID = "";
	Comment = "";
	DogovorID = "";
	FilialID = "";
	FirmID = "";
	INN = "";
	KontragentID = "";
	KPP = "";
	Mail = "";	
	TipDost = "";
	ValutaID = "";
	Дата = Дата(1,1,1);	
	Причина	 = "";
	ЗаказПокупателяСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();
	SkladID	= 0;
	PaymentType	= 0;
	
	Товары.Очистить();

КонецПроцедуры

Функция ПустойСтороннийСклад(НовыйДокЗаказ)
	
	Результат = Ложь;	
	
	Если НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад)  Тогда
		
		Результат = МСК.ЭтоСтороннийСклад(НовыйДокЗаказ.IDСклада);		
		
		Если НЕ Результат Тогда
			Возврат Результат;
		КонецЕсли; 
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада) И НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад)
		И Константы.НеСоздаватьСтороннийСклад.Получить() Тогда
		Результат = Истина;	   
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции

Функция СоздатьЗаказ(ПроверятьЦеныДляEmailЗаказов = Истина, КомментарийЗаказа = "") Экспорт 

	Если SkladID = 0 Тогда
		
		Причина = "Не выбран склад";		
		Возврат Причина; 	
		
	КонецЕсли;

	ПромНомерЗаказа = СокрЛП(Код);
	
	НеСоздаватьНоменклатуруВУТ10 = Константы.НеСоздаватьНоменклатуруВУТ10.Получить(); 
	
	НовыйДокЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	НовыйДокЗаказ.Дата 	 = ТекущаяДата();
	НовыйДокЗаказ.Портал = Истина;
	Причина = ""; 
	
	//+Белов А. 01.12.2025 #НовыйДокЗаказ
	НовыйДокЗаказ.IDЗаказаПортал = IDЗаказаПортал;	
	//-Белов А. 01.12.2025 #НовыйДокЗаказ
	
	ИспользоватьДатуОтгрузкиИзЗаказа = Константы.ИспользоватьДатуОтгрузкиИзЗаказа.Получить();
	
	Если ИспользоватьДатуОтгрузкиИзЗаказа Тогда
		НовыйДокЗаказ.ДатаОтгрузки = Dostavka;
	КонецЕсли;
	
	Если СтрДлина(DogovorID) = 110 Тогда 

		ФилиалGUID			=	СтрПолучитьСтроку(СтрЗаменить(DogovorID, "|", Символы.ПС), 2);
		
		ФилиалКонтрагента	=	Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ФилиалGUID);
		Контрагент			=	ФилиалКонтрагента.ГоловнойКонтрагент;

	Иначе	
		
		Контрагент 			= ?(EMailЗаказ,Контрагент,МСКWEB.НайтиКонтрагентаПоКодуИзПортала(СокрЛП(KontragentID)));
		ФилиалКонтрагента 	= ?(EMailЗаказ,ФилиалКонтрагента,МСКWEB.НайтиФилиалПоКодуИзПортала(СокрЛП(FilialID)));
		
	КонецЕсли;	
	
	Если НЕ ФилиалКонтрагента  = Неопределено И НЕ ФилиалКонтрагента.Пустая() Тогда
		НовыйДокЗаказ.Контрагент = ФилиалКонтрагента;
	ИначеЕсли НЕ Контрагент = Неопределено И НЕ Контрагент.Пустая() Тогда
	    НовыйДокЗаказ.Контрагент = Контрагент;
	Иначе
		
		Причина = "Не найден клиент";		
		Возврат Причина;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) 
		И ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент)
		И НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент <> НовыйДокЗаказ.Контрагент Тогда
		
		НовыйДокЗаказ.Грузополучатель 		= НовыйДокЗаказ.Контрагент;
		НовыйДокЗаказ.Контрагент 			= НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент;
		НовыйДокЗаказ.ДоговорКонтрагента 	= ?(EMailЗаказ, 
		                                       ?(ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент.EMailЗаказ_Договор),
		                                         НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент.EMailЗаказ_Договор,
												 НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент.ОсновнойДоговорКонтрагента),
												 НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента);
		
	Иначе 
		НовыйДокЗаказ.Грузополучатель = НовыйДокЗаказ.Контрагент;		
	КонецЕсли;
	
	Если СтрДлина(DogovorID) >= 110 Тогда               
		
		КодМДМДоговора = СтрПолучитьСтроку(СтрЗаменить(DogovorID, "|", Символы.ПС), 1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.КодМДМ = &КодМДМ";
		
		Запрос.УстановитьПараметр("КодМДМ", КодМДМДоговора);
		
	ИначеЕсли СтрДлина(DogovorID) >= 36 Тогда

		Если СтрДлина(DogovorID) = 36 Тогда
			КодМДМДоговора = DogovorID;
		Иначе
			КодМДМДоговора = Лев(DogovorID, 36);			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ГоловнойКонтрагент
		|ПОМЕСТИТЬ КонтрагентИГоловной
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	(ДоговорыКонтрагентов.Владелец В
		|				(ВЫБРАТЬ
		|					КонтрагентИГоловной.Ссылка
		|				ИЗ
		|					КонтрагентИГоловной КАК КонтрагентИГоловной)
		|			ИЛИ ДоговорыКонтрагентов.Владелец В
		|				(ВЫБРАТЬ
		|					КонтрагентИГоловной.ГоловнойКонтрагент
		|				ИЗ
		|					КонтрагентИГоловной КАК КонтрагентИГоловной))
		|	И ДоговорыКонтрагентов.КодМДМ = &КодМДМ";
		
		Запрос.УстановитьПараметр("КодМДМ", КодМДМДоговора);
		Запрос.УстановитьПараметр("Контрагент", НовыйДокЗаказ.Контрагент);	
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ГоловнойКонтрагент
		|ПОМЕСТИТЬ КонтрагентИГоловной
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыАварды.ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
		|ГДЕ
		|	ДоговорыАварды.КодАварда = &DogovorID
		|	И (ДоговорыАварды.ДоговорКонтрагента.Владелец В
		|				(ВЫБРАТЬ
		|					КонтрагентИГоловной.Ссылка
		|				ИЗ
		|					КонтрагентИГоловной КАК КонтрагентИГоловной)
		|			ИЛИ ДоговорыАварды.ДоговорКонтрагента.Владелец В
		|				(ВЫБРАТЬ
		|					КонтрагентИГоловной.ГоловнойКонтрагент
		|				ИЗ
		|					КонтрагентИГоловной КАК КонтрагентИГоловной))";
		
		Запрос.УстановитьПараметр("DogovorID", DogovorID);
		Запрос.УстановитьПараметр("Контрагент", НовыйДокЗаказ.Контрагент);	
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НовыйДокЗаказ.ДоговорКонтрагента = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйДокЗаказ.ДоговорКонтрагента) Тогда
		
		Если EMailЗаказ Тогда
			НовыйДокЗаказ.ДоговорКонтрагента = ?(ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор),
			                                     НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор,
												 НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента);
		Иначе
			НовыйДокЗаказ.ДоговорКонтрагента = НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента;
		КонецЕсли;		
		
	КонецЕсли;
	
	
	НовыйДокЗаказ.ИсточникЗаказа =  Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", OrderSource); 
	
	Если НовыйДокЗаказ.Контрагент = Константы.ОсновнойПоставщик.Получить() И НовыйДокЗаказ.ИсточникЗаказа = Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", 2) Тогда
		
		ПромДоговорАПИ = Константы.ДоговорДляЗаказаЧерезАПИДляОсновногоПоставщика.Получить();
		
		Если НЕ ПромДоговорАПИ.Пустая() Тогда
			НовыйДокЗаказ.ДоговорКонтрагента = ПромДоговорАПИ;
		КонецЕсли;		
		
	КонецЕсли;
	
	ОсновнойСклад 							= Константы.ОсновнойСклад.Получить();
	НовыйДокЗаказ.СкладГруппа 				= ОсновнойСклад;
	НовыйДокЗаказ.IDСклада 					= SkladID;
	НовыйДокЗаказ.IDСклада_СтороннийСклад 	= МСК.НайтиСтороннийСкладПоID(НовыйДокЗаказ.IDСклада, Истина);
	
	ЭтоСтороннийСклад 						= ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад); 
	
	Если НЕ ЭтоСтороннийСклад И ПустойСтороннийСклад(НовыйДокЗаказ) Тогда		
		ЭтоСтороннийСклад = Истина;	 	
	КонецЕсли; 	
	
	Если ПустойСтороннийСклад(НовыйДокЗаказ) Тогда
		
		Если ПустойСтороннийСклад(НовыйДокЗаказ) Тогда
			Причина = ?(Причина = "", "", Причина + ", ") + "Отсутствует сторонний склад -> Запрет создания сторонних складов";
		КонецЕсли; 
		
	КонецЕсли; 
	
	//+Белов А. 22.10.2024 UT10-4825#
	Если ЭтоСтороннийСклад И ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда
		НовыйДокЗаказ.IDСклада = НовыйДокЗаказ.IDСклада_СтороннийСклад.IDСклада;		
	КонецЕсли;
	//-Белов А. 22.10.2024 #UT10-4825

	НовыйДокЗаказ.ВалютаДокумента = НовыйДокЗаказ.ДоговорКонтрагента.ВалютаВзаиморасчетов;		
	
	//+Белов А. 01.12.2025 #UT10-5562
	Если ЗначениеЗаполнено(КомментарийЗаказа) Тогда
		НовыйДокЗаказ.Комментарий 	  = КомментарийЗаказа; 		
	Иначе
	//-Белов А. 01.12.2025 #UT10-5562
		НовыйДокЗаказ.Комментарий 	  = СокрЛП(Comment); 	
	КонецЕсли;
		
	Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) И НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала 
		И НЕ Константы.ОформлятьВсеЗаказыСПортала.Получить()
		Тогда
		
		Если ЭтоСтороннийСклад Тогда 
			// для сторонних складов берем цены портала
		Иначе
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Не портальная цена; ";
		КонецЕсли;
		
	КонецЕсли;		
    
	////////////////////Заполнение способа доставки///////////////////////////
	//Значения "TipDost" из портала:
	//0 - только резерв
	//1 - самовывоз
	//2 - экспресс доставка
	//3 - трансп компания
	//4 - стандартная доставка
	//5 - такси доставка 
	Если TipDost="1" ИЛИ TipDost = "5" Тогда
		
		Если TipDost = "5" И Константы.ТаксиДоставка.Получить() Тогда 
			
			НовыйДокЗаказ.УпаковыватьСамовывоз = Истина;
			НовыйДокЗаказ.ТаксиДоставка        = Истина; 
			
		КонецЕсли;
		
		НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;
		
	ИначеЕсли TipDost = "2" ИЛИ TipDost = "3" ИЛИ TipDost = "4" Тогда
		НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка;
	ИначеЕсли TipDost = "0" Тогда	
		НовыйДокЗаказ.ТолькоРезерв  = Истина;
		НовыйДокЗаказ.СпособДоставки = НовыйДокЗаказ.Грузополучатель.СпособДоставки;
	Иначе	
		Причина = ?(Причина="",Причина,Причина+", ")+"Не указан способ доставки";
	КонецЕсли; 
	
	НовыйДокЗаказ.Организация = НовыйДокЗаказ.ДоговорКонтрагента.Организация;
	
	Если СокрЛП(НовыйДокЗаказ.Контрагент.ИНН) = "" Тогда 
		
		Если (Константы.База.Получить() = Перечисления.НазваниеБазы.Казань или Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж) 
			И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() Тогда 
		Иначе
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Нет ИНН контрагента";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) 
		И (НЕ TipDost = "5" ИЛИ (TipDost = "5" И НЕ Константы.ТаксиДоставка.Получить()))  Тогда		    
		НовыйДокЗаказ.УпаковыватьСамовывоз = НовыйДокЗаказ.Грузополучатель.УпаковыватьСамовывоз;		
	КонецЕсли;	
	
	Если НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка И НовыйДокЗаказ.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
		НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Справочники.СобственныеСклады.IDСоответстуетОбособленнойОтгрузке(НовыйДокЗаказ.IDСклада);	
	КонецЕсли;
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйДокЗаказ, глЗначениеПеременной("глТекущийПользователь"), 
	                            НовыйДокЗаказ.мВалютаРегламентированногоУчета, "Продажа", Неопределено, Неопределено, 
								НовыйДокЗаказ.мСтруктураПараметровДляПолученияДоговора);
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.ДоговорКонтрагента) Тогда 
		НовыйДокЗаказ.ОплатаНаличными = НовыйДокЗаказ.ДоговорКонтрагента.ОплатаПоДоговоруНаличными;
	КонецЕсли;		

	Если НЕ НовыйДокЗаказ.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Причина = ?(Причина = "", Причина, Причина + ", ") + "Выбран договор не с покупателем";	
	КонецЕсли;
	
	Если НовыйДокЗаказ.ДоговорКонтрагента.Потенциальный Тогда
		Причина = ?(Причина = "", Причина, Причина + ", ") + "В договоре установлен признак Потенциальный";	
	КонецЕсли;		
	
	НовыйДокЗаказ.УчитыватьНДС 		= Истина;
	НовыйДокЗаказ.СуммаВключаетНДС 	= Истина;
	НовыйДокЗаказ.ВалютаДокумента 	= НовыйДокЗаказ.мВалютаРегламентированногоУчета;
	НовыйДокЗаказ.КратностьВзаиморасчетов = 1;
	НовыйДокЗаказ.КурсВзаиморасчетов = 1;
	НовыйДокЗаказ.СкладГруппа 		= ОсновнойСклад;
	
	//+Белов А. 01.12.2025 #UT10-5562
	Если ЗначениеЗаполнено(КомментарийЗаказа) Тогда
		НовыйДокЗаказ.Комментарий 	  = КомментарийЗаказа; 		
	Иначе
	//-Белов А. 01.12.2025 #UT10-5562
		НовыйДокЗаказ.Комментарий 	  = СокрЛП(Comment); 	
	КонецЕсли;
	
	//#############################Заполнение табличной части Заказа ###########################
	ДокСумма = 0;
	
	ТЗКорректировкаЗП = Новый ТаблицаЗначений;
	ТЗКорректировкаЗП.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗКорректировкаЗП.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТЗКорректировкаЗП.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТЗКорректировкаЗП.Колонки.Добавить("РазрешеноКОтгрузке", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТЗКорректировкаЗП.Колонки.Добавить("Отклонение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	
	СобственныйСкладКакСторонний = Ложь;
	
	Если НЕ ЭтоСтороннийСклад Тогда
		СобственныйСкладКакСторонний = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).СоздаватьНоменклатуруВМДМ;
	КонецЕсли;	
	
	Для Каждого стр из Товары Цикл
		
		Артикул = СокрЛП(стр.NumberInv);
		
		Если Артикул = "" И НЕ СобственныйСкладКакСторонний Тогда 
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Не заполнен артикул для позиции в строке " + стр.НомерСтроки + "; ";
		КонецЕсли;	
		
		Товар = ?(ЗначениеЗаполнено(Артикул), МСКWEB.НайтиТоварПоАртикулу(Артикул), Неопределено);
		
		Если Товар = Неопределено Тогда
			
			ОчищенныйПроизводитель = "";
			СтрокаПроверки = ВРег(СокрЛП(стр.Brand));
			Длина = СтрДлина(СтрокаПроверки);
			
			Для а = 1 По Длина Цикл
				
				Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
					ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
				КонецЕсли; 
				
			КонецЦикла;	
			
			ОчищенныйКодПроизводителя = "";
			СтрокаПроверки = СокрЛП(стр.Articul);
			Длина = СтрДлина(СтрокаПроверки); 
			
			Для а = 1 По Длина Цикл           
				
				Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
					ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
				КонецЕсли;   
				
			КонецЦикла;
			
			СтрокаПоиска = ОчищенныйПроизводитель + ОчищенныйКодПроизводителя;
			
			Если Не ПустаяСтрока(СтрокаПоиска) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.НормализованныйКод = &СтрокаПоиска
				|	И НЕ Номенклатура.ПометкаУдаления";
				
				Запрос.УстановитьПараметр("СтрокаПоиска",СтрокаПоиска);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Количество() >= 1 И Выборка.Следующий() Тогда
					Товар = Выборка.Ссылка;
				Иначе 
					Товар = Неопределено;	
				КонецЕсли;
				
			КонецЕсли;
			
			Если Товар = Неопределено Тогда 
				
				// ищем бренд в синонимах
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СинонимыПроизводителей.Производитель КАК Производитель,
				|	СинонимыПроизводителей.СинонимПроизводителя
				|ИЗ
				|	РегистрСведений.СинонимыПроизводителей КАК СинонимыПроизводителей
				|ГДЕ
				|	СинонимыПроизводителей.СинонимПроизводителя = &СинонимПроизводителя";
				
				Запрос.УстановитьПараметр("СинонимПроизводителя", ВРег(СокрЛП(стр.Brand)));
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Количество() >= 1 И Выборка.Следующий() Тогда
					
					ОчищенныйПроизводитель = "";
					СтрокаПроверки = ВРег(СокрЛП(Выборка.Производитель));
					Длина = СтрДлина(СтрокаПроверки);
					
					Для а = 1 По Длина Цикл
						
						Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
							ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
						КонецЕсли; 
						
					КонецЦикла;				
					
					СтрокаПоиска = ОчищенныйПроизводитель + ОчищенныйКодПроизводителя;
					
					Если Не ПустаяСтрока(СтрокаПоиска) Тогда
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	Номенклатура.Ссылка
						|ИЗ
						|	Справочник.Номенклатура КАК Номенклатура
						|ГДЕ
						|	Номенклатура.НормализованныйКод = &СтрокаПоиска
						|	И НЕ Номенклатура.ПометкаУдаления";
						
						Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
						ВыборкаТовар = Запрос.Выполнить().Выбрать();
						
						Если ВыборкаТовар.Количество() >= 1 И ВыборкаТовар.Следующий() Тогда
							Товар = ВыборкаТовар.Ссылка;
						Иначе 
							
							Если НеСоздаватьНоменклатуруВУТ10 Тогда
								
								Товар = Неопределено;
								Причина =  ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
								
							Иначе
								
								Если НЕ МСКWEB.СоздатьНовуюНоменклатуру(Стр, Выборка.Производитель, Товар, Ложь, "", НЕ ЭтоСтороннийСклад или EMailЗаказ) Тогда 
									
									Причина = ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
									Товар = Неопределено;
									
								КонецЕсли;
								
							КонецЕсли;							
							
						КонецЕсли;
						
					Иначе
						
						Причина =  ?(Причина = "", Причина, Причина + ", ") + "Товар не найден " + СтрокаПоиска;
						Товар = Неопределено;
						
					КонецЕсли;
					
				Иначе
					
					Если НеСоздаватьНоменклатуруВУТ10 Тогда
						
						Товар = Неопределено;
						Причина = ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
						
					Иначе
						
						Если НЕ МСКWEB.СоздатьНовуюНоменклатуру(Стр, Справочники.Номенклатура.ПустаяСсылка(), Товар, Ложь, "", НЕ ЭтоСтороннийСклад или EMailЗаказ) Тогда 
							Причина = ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: "+СтрокаПоиска);
						КонецЕсли;
						
					КонецЕсли;					
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Товар = Неопределено Тогда
			
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Не найден товар с артикулом: " + Артикул;
			Продолжить;
			
		ИначеЕсли EMailЗаказ Тогда
			
			стр.NumberInv = Товар.Артикул;
			стр.Articul = Товар.КодПроизводителя;
			стр.Name = Товар.Наименование;
			стр.Brand = СокрЛП(Товар.Родитель.Наименование);
			
		КонецЕсли;
		
		ПромКоличество = стр.Count;    
		
		Если EMailЗаказ Тогда    
			
			РезультатДеления = ПромКоличество / ?(стр.Кратность = 0, 1, стр.Кратность);
			ЦелаяЧасть = Цел(РезультатДеления);
			
			Если НЕ РезультатДеления = ЦелаяЧасть Тогда
				
				Если стр.РазрешеноКОтгрузке = 0 Тогда
					
					Сообщить("В строке " + стр.НомерСтроки + " нарушена кратность, строка не будет добавлена в заказ !");
					Продолжить;        
					
				КонецЕсли;  
				
				ПромКоличество = стр.РазрешеноКОтгрузке;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();	
		НоваяСтрока.Номенклатура 		= Товар;
		НоваяСтрока.ЕдиницаИзмерения 	= Товар.ЕдиницаХраненияОстатков;
		НоваяСтрока.ЦенаЗакупки 		= стр.Price_Zak;
		
		Попытка
			НоваяСтрока.ПроизводительПоставщика = СокрЛП(стр.ПроизводительПоставщика);
		Исключение
		КонецПопытки;

		НовыйДокЗаказ.ПриИзмененииНоменклатурыТоваров(НоваяСтрока);
		НоваяСтрока.Количество = ПромКоличество;
		
		Если НЕ НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала ИЛИ ЭтоСтороннийСклад ИЛИ EMailЗаказ Тогда 
			НоваяСтрока.Цена = стр.Price;
		КонецЕсли;	
		
		СтрСумма = НоваяСтрока.Количество*НоваяСтрока.Цена;
		НоваяСтрока.Сумма = СтрСумма;
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
		
		НоваяСтрока.Комментарий = стр.Comment;
		ДокСумма = ДокСумма + СтрСумма;
		
		Если EMailЗаказ И ПромКоличество > Стр.РазрешеноКОтгрузке Тогда 
			
			СтрКорректировки = ТЗКорректировкаЗП.Добавить();
			СтрКорректировки.Номенклатура = Товар;
			СтрКорректировки.Цена = Стр.Price;
			СтрКорректировки.Количество = ПромКоличество;
			СтрКорректировки.РазрешеноКОтгрузке = Стр.РазрешеноКОтгрузке;
			СтрКорректировки.Отклонение = ПромКоличество - Стр.РазрешеноКОтгрузке;
			
		КонецЕсли;
		
	КонецЦикла;   
	
	НовыйДокЗаказ.СуммаДокумента = ДокСумма;
	
	//Сравниваем цены, если отклонение до % допустимого отклонения, то пропускаем
	Если EMailЗаказ                   
		И ПроверятьЦеныДляEmailЗаказов //+Белов А. 01.12.2025 #UT10-5562
		И ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) 
		И ЗначениеЗаполнено(НовыйДокЗаказ.ДоговорКонтрагента) Тогда
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Цена");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Цена КАК ЦенаКлиента
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ЕСТЬNULL(ТаблицаНоменклатура.ЦенаКлиента,0) КАК ЦенаКлиента,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПоДоговору
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ТаблицаНоменклатура.Номенклатура
		|						ИЗ
		|							ТаблицаНоменклатура)
		|					И ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
		
		Запрос.УстановитьПараметр("ТипЦенЗаказ", ?(ЗначениеЗаполнено(ТипЦенЗаказ), ТипЦенЗаказ, НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен));
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		ПроцентОтклонения = НовыйДокЗаказ.Контрагент.EMailЗаказ_КонтролироватьРасхождениеЦенВПроцентах;
		
		Для Каждого СтрРезультата Из Результат Цикл
			
			Отбор = Новый Структура("Articul,NumberInv,Price", СтрРезультата.Номенклатура.КодПроизводителя, СтрРезультата.Номенклатура.Артикул, СтрРезультата.ЦенаКлиента);
			СтрокиНеСоздЗП = Товары.НайтиСтроки(Отбор);
			
			//Если в файле клиента нет цены
			Если (СтрРезультата.ЦенаКлиента = 0) и ЗначениеЗаполнено(СтрРезультата.ЦенаПоДоговору) Тогда
				
				СтрокиДок = НовыйДокЗаказ.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрРезультата.Номенклатура));
				
				Для Каждого СтрДок Из СТрокиДок Цикл
					
					СтрДок.Цена = СтрРезультата.ЦенаПоДоговору;
					СтрДок.Сумма = СтрДок.Цена * СтрДок.Количество;
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, НовыйДокЗаказ);
					ДокСумма = НовыйДокЗаказ.Товары.Итог("Сумма");
					
				КонецЦикла;
				
				Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл
					СтрНеСоздЗП.Price = СтрРезультата.ЦенаПоДоговору;
				КонецЦикла;
				
			Иначе
				
				СтрПричина = "";
				ОтклонениеЦены = Ложь;
				
				Если СтрРезультата.ЦенаПоДоговору = 0 Тогда
					
					СтрПричина = "Не задана цена по договору";
					
					Если Найти(Причина, "Не задана цена по договору") = 0 Тогда
						Причина = ?(Причина = "", Причина, Причина + ", ") + "Не задана цена по договору для товара(ов)";
					КонецЕсли;
					
				ИначеЕсли (СтрРезультата.ЦенаКлиента > 0) И (СтрРезультата.ЦенаКлиента < Окр(СтрРезультата.ЦенаПоДоговору * (1 - ПроцентОтклонения / 100), 2)) Тогда
					
					СтрПричина = Окр(СтрРезультата.ЦенаПоДоговору*(1-ПроцентОтклонения/100), 2);
					ОтклонениеЦены = Истина;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрПричина) Тогда
					
					Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл
						
						Если СтрНеСоздЗП.ЦенаОтгрузки <> СтрПричина Тогда
							
							Если Найти(СтрНеСоздЗП.Причина, "Откл. цены") = 0 Тогда 
								СтрНеСоздЗП.Причина = ?(СтрНеСоздЗП.Причина = "", СтрНеСоздЗП.Причина, СтрНеСоздЗП.Причина + ", ") + "Откл. цены";
							КонецЕсли;
							
							СтрНеСоздЗП.ЦенаОтгрузки = СтрПричина; 
							СтрНеСоздЗП.РазрешеноКОтгрузке = 0;
							
							Если ОтклонениеЦены И Найти(Причина, "Отклонение цены") = 0 Тогда
								Причина = ?(Причина = "", Причина, Причина + ", ") + "Отклонение цены более " + Строка(ПроцентОтклонения) + "%";
							КонецЕсли;
							
						КонецЕсли;					
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ СокрЛП(Причина) = "" Тогда		
		Возврат Причина;
	КонецЕсли;		   
	
	ЕстьНоменклатураТребующаяМаркировки = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить());
	
	//+Шульман А. 20.10.2025 #UT10-5457
	Если НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала И ЕстьНоменклатураТребующаяМаркировки Тогда  
		НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Ложь;     
	КонецЕсли;
	//-Шульман А. 20.10.2025 #UT10-5457
	
	Попытка		
		НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Запись);		
	Исключение
		
		Результат = "Произошла ошибка при создании документа!"; 
		Возврат Результат;
		
	КонецПопытки;
	
	ЗаказПокупателяСсылка = НовыйДокЗаказ.Ссылка;
	ЭтотОбъект.Записать(); 
	
	//_Заполнить и провести
	ВидимостьСерии = Истина;
	Авторезервирование = Истина;
	Авторазмещение = Ложь;
	СтратегияАвторезервированияПоЗаказам = Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидимостьСерии",     ВидимостьСерии);
	СтруктураПараметров.Вставить("Авторезервирование", Авторезервирование);
	СтруктураПараметров.Вставить("Авторазмещение",     Авторазмещение);
	СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", СтратегияАвторезервированияПоЗаказам);
	
	НовыйДокЗаказ.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);
	
	СобственныйСкладКакСторонний = Ложь;
	
	Если НЕ ЭтоСтороннийСклад Тогда
		СобственныйСкладКакСторонний = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).ИсключитьИзОбщегоЭкспресса; 
	КонецЕсли;
	
	//Из резервирования исключаем склад "Брак"
	СкладФильтр = ОсновнойСклад;
	
	Для Каждого Стр Из НовыйДокЗаказ.Товары Цикл	
		
		Если НЕ Стр.Размещение = СкладФильтр ИЛИ НЕ ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда					
			Стр.Размещение = ""; 
		ИначеЕсли НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
			Стр.Размещение = ""; 	
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ТекущаяДата() >= Константы.РезервированиеЗаказовСУчетомЯчеек.Получить() тогда
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Размещение", "Количество"); 		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
		|ПОМЕСТИТЬ КонстКратности
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Размещение <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Остаток,
		|	1 КАК Поле1
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыГотовыеКСборкеОстатки.Номенклатура,
		|	-ТоварыГотовыеКСборкеОстатки.КоличествоОстаток,
		|	3
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	СУММА(Остатки.Остаток) КАК Остаток,
		|	ВЫБОР
		|		КОГДА КонстКратности.ЗначениеКонстанты
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
		|						ТОГДА Остатки.Номенклатура.КратностьФилиала
		|					ИНАЧЕ Остатки.Номенклатура.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ Остатки.Номенклатура.Кратность
		|	КОНЕЦ КАК Кратность
		|ПОМЕСТИТЬ ОстаткиГруппа
		|ИЗ
		|	Остатки КАК Остатки,
		|	КонстКратности КАК КонстКратности
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	ВЫБОР
		|		КОГДА КонстКратности.ЗначениеКонстанты
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
		|						ТОГДА Остатки.Номенклатура.КратностьФилиала
		|					ИНАЧЕ Остатки.Номенклатура.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ Остатки.Номенклатура.Кратность
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиГруппа.Номенклатура,
		|	СУММА(ОстаткиГруппа.Остаток) КАК Остаток,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиГруппа.Остаток > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ОстаткиГруппа.Кратность > ОстаткиГруппа.Остаток
		|							ТОГДА 0
		|						ИНАЧЕ ВЫБОР
		|								КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|									ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|								ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|						ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|					ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))
		|				КОНЕЦ
		|		КОНЕЦ) КАК ОстатокПоКратности
		|ПОМЕСТИТЬ ОстаткиИтог
		|ИЗ
		|	ОстаткиГруппа КАК ОстаткиГруппа
		|ГДЕ
		|	ОстаткиГруппа.Остаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиГруппа.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0)
		|	КОНЕЦ КАК Нехватка_,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
		|	КОНЕЦ КАК Нехватка
		|ПОМЕСТИТЬ Рез
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИтог КАК ОстаткиИтог
		|		ПО ТаблицаНоменклатура.Номенклатура = ОстаткиИтог.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рез.Номенклатура,
		|	Рез.Нехватка
		|ИЗ
		|	Рез КАК Рез
		|ГДЕ
		|	Рез.Нехватка > 0"; 
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Табл = Запрос.Выполнить().Выгрузить();
		
		Для каждого стр из Табл Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Стр.Номенклатура);
			Строки = НовыйДокЗаказ.Товары.НайтиСтроки(Отбор);
			КУменьшению = Стр.Нехватка;
			
			Для каждого строка из Строки Цикл
				
				Если КУменьшению > 0 тогда
					
					Если Строка.Количество > КУменьшению тогда
						
						НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,, "КлючСтроки");
						Строка.Количество = Строка.Количество-КУменьшению;
						НоваяСтрока.Количество = КУменьшению;
						НоваяСтрока.Размещение = "";
						НоваяСтрока.СерияНоменклатуры = "";

						КУменьшению = 0;
						СтрСумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
						НоваяСтрока.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
						
						СтрСумма = Строка.Количество * Строка.Цена;
						Строка.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, НовыйДокЗаказ);
						
					Иначе
						
						КУменьшению = КУменьшению - Строка.Количество;
						Строка.Размещение = "";
						Строка.СерияНоменклатуры = "";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоСтороннийСклад ИЛИ СобственныйСкладКакСторонний Тогда 
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Цена,Коэффициент,Размещение,СерияНоменклатуры", "Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Цена КАК ЦенаПортал,
		|	ТЗ.Коэффициент КАК Коэффициент,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение,
		|	ТЗ.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЦенаПортал,
		|	СправочникНоменклатура.Кратность КАК Коэффициент,
		|	ТаблицаНоменклатура.Количество,
		|	ТаблицаНоменклатура.Размещение,
		|	ТаблицаНоменклатура.СерияНоменклатуры
		|ПОМЕСТИТЬ ТабОстатков
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТаблицаНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	ТаблицаНоменклатура.СерияНоменклатуры <> &ПустаяСерия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабОстатков.Номенклатура,
		|	ТабОстатков.ЦенаПортал,
		|	ТабОстатков.Количество,
		|	ТабОстатков.Коэффициент,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаПоДоговору,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 1)) КАК Дробное,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Целое
		|ИЗ
		|	ТабОстатков КАК ТабОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ТабОстатков.Номенклатура
		|						ИЗ
		|							ТабОстатков КАК ТабОстатков)
		|					И ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТабОстатков.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦенЗаказ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Рубль) КАК КурсРубля
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТабОстатков.ЦенаПортал >= ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|						ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|									И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|									И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|									И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|								ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|							ИНАЧЕ 0
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 1))) = (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 0)))";
		
		
		Запрос.УстановитьПараметр("ТипЦенЗаказ", НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен);
		Запрос.УстановитьПараметр("Рубль", Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяСерия", Справочники.СерииНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 ИЛИ НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда 
			
			Для каждого Стр Из НовыйДокЗаказ.Товары Цикл
				
				Стр.Размещение = "";
				Стр.СерияНоменклатуры = "";
				
			КонецЦикла;
			
		Иначе
			
			Для каждого Стр Из НовыйДокЗаказ.Товары Цикл
				
				Если Результат.Найти(Стр.Номенклатура, "Номенклатура") = Неопределено Тогда 
					
					Стр.Размещение = "";
					Стр.СерияНоменклатуры = "";
					
				Иначе
					// возможно меняем цену на нашу ?
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыйДокЗаказ.ТолькоРезерв Тогда
		
		ПромТабличнаяЧасть = НовыйДокЗаказ.Товары.Выгрузить();
		ПромТабличнаяЧасть.ЗаполнитьЗначения(НовыйДокЗаказ.ТолькоРезерв, "ТолькоРезерв");
		НовыйДокЗаказ.Товары.Загрузить(ПромТабличнаяЧасть);
		
	КонецЕсли;
	
	Попытка
		
		//+Белов А. 10.03.2026 #UT10-5729
		ВыделитьМаркировкуВОтдельныйЗаказ = Ложь;
		
		//Если основная организация
		Если НовыйДокЗаказ.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
			ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Константы.ВыделятьТоварыСМаркировкойПоОснОрганизацииВОтдельныйЗаказ.Получить() И МСКWEB.ПоДоворуНужноВыделениеЗаказаСМаркировкойВОтдельный(НовыйДокЗаказ.ДоговорКонтрагента);		
		Иначе
			//Если управленческая организация	
			ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить();  				
		КонецЕсли;
		
		Если ВыделитьМаркировкуВОтдельныйЗаказ Тогда
			
			СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
			НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;  
			
		Иначе
			НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
		КонецЕсли;
		
		////+Белов А. 25.12.2025 #UT10-5586
		//Если Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить() 
		//	И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() 
		//	И Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) Тогда
		//	
		//	СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
		//	НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;
		//	
		////-Белов А. 25.12.2025 #UT10-5586	
		//Иначе
		//	
		//	НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
		//КонецЕсли;  
		//-Белов А. 10.03.2026 #UT10-5729
	
		Результат = "";
		
		ТЗКорректировкаЗП.Свернуть("Номенклатура,Цена", "Количество, РазрешеноКОтгрузке, Отклонение");
		
		Если ТЗКорректировкаЗП.Количество() > 0 Тогда
			
			СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ, ТЗКорректировкаЗП); 
			
			НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
			НовыйДок.Дата = ТекущаяДата() + 1;
			
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("ДокументОснование", НовыйДокЗаказ.Ссылка);
			СтруктураЗаполнения.Вставить("ТипЗаполнения", "ПоНесозданнымЗаказам");
			СтруктураЗаполнения.Вставить("ТЗКорректировкаЗП", ТЗКорректировкаЗП);
			
			НовыйДок.Заполнить(СтруктураЗаполнения);
			
			Если НовыйДок.Товары.Количество() > 0 Тогда
				
				Попытка
					
					НовыйДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный); 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Автоматически создана " + Строка(НовыйДок.Ссылка) + " к документу " + Строка(НовыйДокЗаказ.Ссылка));
					
				Исключение
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании корректировки заказа покупателя. Проверьте и проведите документ вручную!");
					НовыйДок.ПолучитьФорму("ФормаДокумента").Открыть();
					
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			мКоментарий = "Документ сформирован автоматически при создании заказа из несозданных";			
			МСКWEB.СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ,, мКоментарий); 
			
		КонецЕсли;
		
		Возврат "";	
		
	Исключение
		
		Результат = "Произошла ошибка при записи и проведении документа!";
		Возврат Результат;	
		
	КонецПопытки;
			
КонецФункции

Функция СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ, ТЗКорректировкаЗП)
	                                                                          
	ТоварыТолькоСоСклада = НовыйДокЗаказ.Грузополучатель.ТоварыТолькоСоСклада ИЛИ НовыйДокЗаказ.ТаксиДоставка;  

	Если Не ТоварыТолькоСоСклада Тогда
		
		Если Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала.Получить() Тогда
			Возврат СоздатьКорректировкаЗаказаПокупателяПоКратностиФилиала(НовыйДокЗаказ, ТЗКорректировкаЗП);
		Иначе
			Возврат ТЗКорректировкаЗП; 
		КонецЕсли;		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Цена,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Ссылка.СкладГруппа КАК Склад,
	|	ЗаказПокупателяТовары.Количество
	|ПОМЕСТИТЬ ТабЗакПокуп
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Склад,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ТабТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗакПокуп.Ссылка,
	|	ТабЗакПокуп.Номенклатура КАК Номенклатура,
	|	ТабЗакПокуп.Цена КАК Цена,
	|	ТабЗакПокуп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакПокуп.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТабЗакПокуп.Склад,
	|	СУММА(ТабЗакПокуп.Количество) КАК Количество,
	|	СУММА(ЕСТЬNULL(ТабТоварыВРезерве.КоличествоВРезерве, 0)) КАК КоличествоВРезерве
	|ИЗ
	|	ТабЗакПокуп КАК ТабЗакПокуп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТоварыВРезерве КАК ТабТоварыВРезерве
	|		ПО ТабЗакПокуп.Ссылка = ТабТоварыВРезерве.ДокументРезерва
	|			И ТабЗакПокуп.Номенклатура = ТабТоварыВРезерве.Номенклатура
	|			И ТабЗакПокуп.ХарактеристикаНоменклатуры = ТабТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ТабЗакПокуп.СерияНоменклатуры = ТабТоварыВРезерве.СерияНоменклатуры
	|			И ТабЗакПокуп.Склад = ТабТоварыВРезерве.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЗакПокуп.Ссылка,
	|	ТабЗакПокуп.Номенклатура,
	|	ТабЗакПокуп.ХарактеристикаНоменклатуры,
	|	ТабЗакПокуп.СерияНоменклатуры,
	|	ТабЗакПокуп.Склад,
	|	ТабЗакПокуп.Цена
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", НовыйДокЗаказ.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Номенклатура = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	СерияНоменклатуры = Неопределено;
	
	КоличествоВРезерве = 0;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если Номенклатура <> РезультатЗапроса.Номенклатура Или 
			ХарактеристикаНоменклатуры <> РезультатЗапроса.ХарактеристикаНоменклатуры Или 
			СерияНоменклатуры <> РезультатЗапроса.СерияНоменклатуры Тогда
			
			ХарактеристикаНоменклатуры = РезультатЗапроса.ХарактеристикаНоменклатуры;
			СерияНоменклатуры = РезультатЗапроса.СерияНоменклатуры;
			Номенклатура = РезультатЗапроса.Номенклатура;
			
			КоличествоВРезерве = РезультатЗапроса.КоличествоВРезерве;
			
		КонецЕсли; 
		
		Если РезультатЗапроса.Количество <= КоличествоВРезерве Тогда
			КоличествоВРезерве = КоличествоВРезерве - РезультатЗапроса.Количество;
		Иначе
			
			КоличествоКорректировки = РезультатЗапроса.Количество - КоличествоВРезерве;
			КоличествоВРезерве = 0;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", РезультатЗапроса.Номенклатура);
			ПараметрыОтбора.Вставить("Цена", РезультатЗапроса.Цена);
			
			Если ТЗКорректировкаЗП.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
				
				НоваяСтрока = ТЗКорректировкаЗП.Добавить();	
				НоваяСтрока.Номенклатура = РезультатЗапроса.Номенклатура;
				НоваяСтрока.Цена = РезультатЗапроса.Цена;
				НоваяСтрока.Количество = РезультатЗапроса.Количество;
				НоваяСтрока.РазрешеноКОтгрузке = КоличествоВРезерве;
				НоваяСтрока.Отклонение = КоличествоКорректировки;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТЗКорректировкаЗП;

КонецФункции

Функция СоздатьКорректировкаЗаказаПокупателяПоКратностиФилиала(НовыйДокЗаказ, ТЗКорректировкаЗП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.НомерСтроки,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Ссылка.СкладГруппа КАК Склад,
	|	ЗаказПокупателяТовары.Количество
	|ПОМЕСТИТЬ ТабЗакПокуп
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Склад,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ТабТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗакПокуп.Ссылка,
	|	ТабЗакПокуп.НомерСтроки,
	|	ТабЗакПокуп.Номенклатура КАК Номенклатура,
	|	ТабЗакПокуп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакПокуп.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТабЗакПокуп.Склад,
	|	ТабЗакПокуп.Количество,
	|	ЕСТЬNULL(ТабТоварыВРезерве.КоличествоВРезерве, 0) КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТабЗакПокуп КАК ТабЗакПокуп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТоварыВРезерве КАК ТабТоварыВРезерве
	|		ПО ТабЗакПокуп.Ссылка = ТабТоварыВРезерве.ДокументРезерва
	|			И ТабЗакПокуп.Номенклатура = ТабТоварыВРезерве.Номенклатура
	|			И ТабЗакПокуп.ХарактеристикаНоменклатуры = ТабТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ТабЗакПокуп.СерияНоменклатуры = ТабТоварыВРезерве.СерияНоменклатуры
	|			И ТабЗакПокуп.Склад = ТабТоварыВРезерве.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Ссылка,
	|	ИтоговаяТаблица.НомерСтроки,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.ХарактеристикаНоменклатуры,
	|	ИтоговаяТаблица.СерияНоменклатуры,
	|	ИтоговаяТаблица.Склад,
	|	ИтоговаяТаблица.Количество,
	|	ИтоговаяТаблица.КоличествоВРезерве
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.КоличествоВРезерве = 0
	|	И НЕ ИтоговаяТаблица.Номенклатура.НеОчищатьКратностьПриНулевыхОстатках
	|	И ВЫБОР
	|			КОГДА НЕ ЦЕЛ(ИтоговаяТаблица.Количество / ИтоговаяТаблица.Номенклатура.Кратность) = ИтоговаяТаблица.Количество / ИтоговаяТаблица.Номенклатура.Кратность
	|					И НЕ ИтоговаяТаблица.Номенклатура.Кратность = ИтоговаяТаблица.Номенклатура.КратностьФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", НовыйДокЗаказ.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Номенклатура = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	СерияНоменклатуры = Неопределено;
	КоличествоВРезерве = 0;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если Номенклатура <> РезультатЗапроса.Номенклатура Или 
			ХарактеристикаНоменклатуры <> РезультатЗапроса.ХарактеристикаНоменклатуры Или 
			СерияНоменклатуры <> РезультатЗапроса.СерияНоменклатуры Тогда
			
			ХарактеристикаНоменклатуры = РезультатЗапроса.ХарактеристикаНоменклатуры;
			СерияНоменклатуры = РезультатЗапроса.СерияНоменклатуры;
			Номенклатура = РезультатЗапроса.Номенклатура;
			КоличествоВРезерве = РезультатЗапроса.КоличествоВРезерве;
			
		КонецЕсли; 
		
		Если РезультатЗапроса.Количество <= КоличествоВРезерве Тогда
			КоличествоВРезерве = КоличествоВРезерве - РезультатЗапроса.Количество;
		Иначе
			
			КоличествоКорректировки = РезультатЗапроса.Количество - КоличествоВРезерве;
			КоличествоВРезерве = 0;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", РезультатЗапроса.Номенклатура);
			ПараметрыОтбора.Вставить("Цена", РезультатЗапроса.Цена);
			
			Если ТЗКорректировкаЗП.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
				
				НоваяСтрока = ТЗКорректировкаЗП.Добавить();	
				НоваяСтрока.Номенклатура = РезультатЗапроса.Номенклатура;
				НоваяСтрока.Цена = РезультатЗапроса.Цена;
				НоваяСтрока.Количество = РезультатЗапроса.Количество;
				НоваяСтрока.РазрешеноКОтгрузке = КоличествоВРезерве;
				НоваяСтрока.Отклонение = КоличествоКорректировки;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТЗКорректировкаЗП;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	//+Белов А. 01.12.2025 #UT10-5450 добавил в условие EMailЗаказ
	Если Константы.ЗаписыватьДанныеВРегистрСтатусыЗаказов.Получить() И НЕ EMailЗаказ Тогда
		СтатусыЗаказов.ПоместитьВОчередьВФоне(ЭтотОбъект.Ссылка);             
	КонецЕсли;
	
	//+Гавриленков В. 31.05.2025 #UT10-5264
	//IDЗаказаПортал = Число(Код);
	//-Гавриленков В. 31.05.2025 #UT10-5264
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	//+Гавриленков В. 31.05.2025 #UT10-5264 
	IDЗаказаПортал = Число(Код);
	//-Гавриленков В. 31.05.2025 #UT10-5264	
	
КонецПроцедуры
